# _*_ coding: utf-8 _*_


manual_synos = {
    '空调': {
        'operate': {
            '调节': {'调节': 1, '调整': 1, '改变': 1, '调': 1, '设置': 1, '更改': 1, '更换': 1, '设定': 1},
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        },
        'function': {
            '分区': {'分区': 1},
            '除霜': {'除霜': 1, '除雾': 1},
        },
        'category': {
            '三区模式': {'三区模式': 1, '三区': 1},
            '双区模式': {'双区模式': 1, '双区': 1, '两区': 1, '二区': 1},
            '后排空调': {'后排空调': 1, '单独控制': 1},
        },
        'position': {
            '后排': {'后排': 1, '后': 1},
            '前排': {'前排': 1, '前': 1},
            '车顶出风口': {'车顶出风口': 1},
            '仪表两旁出风口': {'仪表两旁出风口': 1, '侧出风': 1},
            '仪表中央出风口': {'仪表中央出风口': 1, '仪表盘出风': 1, '中间': 1},
        },
        'property': {
            '出风模式': {'出风模式': 1},
            '风速': {'风速': 1},
            '风向': {'风向': 1},
            '负离子空气净化器': {'负离子空气净化器': 1, '净化器': 1},
            '切换模式': {'切换模式': 1, '内外循环': 1},
            '内循环': {'内循环': 1},
            '外循环': {'外循环': 1},
            '最大制冷模式': {'最大制冷模式': 1, '最大制冷': 1},
            '温度': {'温度': 1},
            '制冷': {'制冷': 1, '冷风': 1},
        },
    },
    '车灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        },
        'part': {
            '角灯': {'角灯': 1},
            '开门灯': {'开门灯': 1},
            '阅读灯': {'阅读灯': 1},
            '点烟器照明灯': {'点烟器照明灯': 1},
            '转向灯': {'转向灯': 1},
            '智能迎宾灯': {'智能迎宾灯': 1},
            '远光灯': {'远光灯': 1},
            '迎宾照明灯': {'迎宾照明灯': 1},
            '小灯': {'小灯': 1},
            '雾灯': {'雾灯': 1},
            '双闪灯': {'双闪灯': 1},
            '上车照明灯': {'上车照明灯': 1},
            '日间行车灯': {'日间行车灯': 1},
            '近光灯': {'近光灯': 1},
            '照明灯': {'照明灯': 1},
            '氛围灯': {'氛围灯': 1},
            '行李箱照明灯': {'行李箱照明灯': 1},
            '手套箱照明灯': {'手套箱照明灯': 1},
        }
    },
    '角灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '打开': {'打开': 1, '开启': 1}, }
    },
    '安全带': {
        'position': {
            '第一排': {'第一排': 1, '前排': 1},
            '第二排': {'第二排': 1, '后排': 1},
            '第三排': {'第三排': 1}, },
        'operate': {
            '佩戴': {'佩戴': 1, '系': 1, '绑': 1, '勒': 1, '使用': 1, '用': 1, '使': 1},
            '解开': {'解开': 1, '松开': 1},
            '调节': {'调节': 1, '搞': 1, '整': 1},
        }
    },
    '点烟器照明灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        },
    },
    '定速巡航': {
        'operate': {
            '调高': {'调高': 1, '提高': 1},
            '调低': {'调低': 1, '降低': 1},
            '恢复': {'恢复': 1, '复位': 1},
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '儿童座椅': {
        'category': {
            'ISOFIX': {'ISOFIX': 1, '欧版': 1},
            'LATCH': {'LATCH': 1, '美版': 1},
            '三点式': {'三点式': 1},
        },
        'operate': {
            '安装': {
                '安装': 1, '固定': 1, '安': 1, '装': 1,
                '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '放置': 1, '安放': 1},
        }
    },
    '方向盘': {
        'operate': {
            '调节': {
                '调节': 1, '调整': 1, '改变': 1, '调': 1, '设置': 1, '更改': 1, '更换': 1, '设定': 1,
                '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1},
        },
        'property': {'位置': {'位置': 1}}
    },
    '氛围灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
        }
    },
    '扶手': {
        'operate': {
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '打开': {'打开': 1, '开启': 1},
        },
        'position': {'后排': {'后排': 1}}
    },
    '行李箱照明灯': {
        'operate': {
            '更换': {'更换': 1, '换': 1},
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '机械钥匙': {
        'operate': {
            '取出': {'取出': 1, '拿出': 1, '拔出': 1, '拔': 1}, }
    },
    '近光灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        },
    },
    '开门灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '启用': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1, '禁用': 1},
        }
    },
    '喇叭': {
        'operate': {
            '鸣笛': {'鸣笛': 1, '使用': 1, '嘀嘀': 1, '用': 1}, }
    },
    '日间行车灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1}, }
    },
    '上车照明灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1}, }
    },
    '双闪灯': {
        'operate': {
            '开启': {
                '开启': 1, '打开': 1, '开': 1, '启动': 1,
                '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '闪': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '手套箱照明灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '更换': {'更换': 1, '换': 1},
        }
    },
    '天窗': {
        'category': {
            '全景': {'全景': 1},
            '非全景': {'非全景': 1},
        },
        'operate': {
            '外翻': {'外翻': 1},
            '初始化': {'初始化': 1},
            '打开': {'打开': 1, '开启': 1, '使用': 1, '开': 1, '使': 1, '搞': 1, '整': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1, '遥控': 1}
        }
    },
    '雾灯': {
        'position': {
            '前': {'前': 1},
            '后': {'后': 1},
        },
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '小灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '迎宾照明灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '遥控钥匙': {
        'operate': {
            '更换': {'更换': 1, '替换': 1, '换': 1},
        }
    },
    '头枕': {
        'operate': {
            '调节': {'调节': 1, '调整': 1, '改变': 1, '调': 1, '设置': 1, '更改': 1, '更换': 1, '设定': 1},
        }
    },
    '阅读灯': {
        'position': {
            '前': {'前': 1, '前排': 1},
            '后': {'后': 1, '后排': 1},
        },
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }},
    '远光灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '瞬时接通': {'瞬时接通': 1, '接通': 1, '立即开启': 1, '闪': 1, '闪烁': 1},
        }
    },
    '雨刮': {
        'category': {
            '清洗模式': {'清洗模式': 1, '喷水': 1},
            '快刮水': {'快刮水': 1, '调快': 1},
            '慢刮水': {'慢刮水': 1, '调慢': 1},
            '连续刮水': {'连续刮水': 1},
            '自动模式': {'自动模式': 1, '自动': 1},
        },
        'function': {'灵敏度': {'灵敏度': 1},},
        'position': {
            '前': {'前': 1},
            '后': {'后': 1},
        },
        'operate': {
            '调节': {'调节': 1, '调整': 1, '改变': 1, '设置': 1, '更改': 1, '更换': 1, '设定': 1,'调': 1},
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '调快': 1, '调慢': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '更换': {'更换': 1, '换': 1},
            '清洗': {'清洗': 1}
        }
    },
    '照明灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '遮阳板': {
        'category': {
            '手动': {'手动': 1},
            '自动': {'自动': 1},
        },
        'operate': {
            '打开': {'打开': 1, '开启': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '智能迎宾灯': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
        }
    },
    '转向灯': {
        'position': {
            '左': {'左': 1},
            '右': {'右': 1},
        },
        'operate': {
            '开启': {
                '开启': 1, '打开': 1, '开': 1, '启动': 1,
                '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1, '亮': 1, '闪': 1},
        }
    },
    '座椅': {
        'property': {
            '温度': {'温度': 1},
            '制冷': {'制冷': 1},
            '高度': {'高度': 1},
            '加热': {'加热': 1},
            '靠背': {'靠背': 1},
            '距离': {'距离': 1, '前后': 1},
            '通风': {'通风': 1},
            '腰靠': {'腰靠': 1},
        },
        'position': {
            '主驾驶': {'主驾驶': 1},
            '副驾驶': {'副驾驶': 1},
            '后排': {'后排': 1, '后': 1},
            '第二排': {'第二排': 1, '后排': 1},
            '第三排': {'第三排': 1},
        },
        'operate': {
            '调节': {
                '调节': 1, '调整': 1, '改变': 1, '调': 1, '设置': 1, '更改': 1, '更换': 1, '设定': 1, '使用': 1,
                '用': 1, '使': 1, '搞': 1, '整': 1
            },
            '开启': {'开启': 1, '打开': 1, '开': 1, '启动': 1, '使用': 1, '用': 1, '使': 1, '搞': 1, '整': 1},
            '关闭': {'关闭': 1, '退出': 1, '关': 1, '关上': 1, '关掉': 1},
            '放倒': {'放倒': 1},
            '使用': {'使用': 1}
        },
        'function': {
            '记忆': {'记忆': 1}
        },
        'condition': {
            '提取': {'提取': 1},
            '存储': {'存储': 1},
            '遥控钥匙识别': {'遥控钥匙识别': 1}
        }
    },
    '发动机': {
        'operate': {
            '启动': {'启动': 1, '打着': 1, '着': 1, '点火': 1, '发动': 1},
            '关闭': {'关闭': 1, '关': 1, '关停': 1, '关掉': 1, '停用': 1, '熄火': 1, '灭': 1},
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1, '遥控器': 1, '智能遥控器': 1},
        }
    },
    '保险丝': {
        'operate': {
            '更换': {'更换': 1, '换': 1, '替换': 1}
        }
    },
    '杯架': {
        'position': {
            '前排': {'前排': 1, '前': 1},
            '后排': {'后排': 1, '前': 1},
        },
        'operate': {
            '打开': {'打开': 1, '使用': 1, '用': 1, '启用': 1, '使': 1, '收回': 1, '合起': 1, '合上': 1, '收起': 1}
        }
    },
    '备胎': {
        'operate': {
            '取出': {'取出': 1, '拿出': 1, '取': 1},
            '安装': {'安装': 1, '装上': 1, '装': 1, '安': 1},
        }
    },
    '并线辅助系统': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '开开': 1, '使用': 1, '设置': 1},
            '关闭': {'关闭': 1, '关上': 1, '关了': 1, '退出': 1, '闭了': 1, '关': 1}
        }
    },
    '玻璃水': {
        'operate': {
            '添加': {'添加': 1, '加注': 1, '补加': 1, '添': 1, '加': 1, '补': 1}
        }
    },
    '车窗': {
        'operate': {
            '关闭': {'关闭': 1, '升起': 1, '关上': 1, '关': 1, '打开': 1, '降': 1, '落': 1, '关掉': 1, '上升': 1},
            '打开': {'打开': 1, '降下': 1, '落下': 1, '开': 1, '开开': 1, '开启': 1, '下降': 1},
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1, '遥控器': 1, '智能遥控器': 1},
            '驾驶员': {'驾驶员': 1, '主驾驶': 1},
            '乘员': {'乘员': 1, '副驾驶': 1, '乘客': 1},
        }
    },
    '车道偏离预警系统': {
        'operate': {
            '开启': {'开启': 1, '使用': 1, '用': 1, '使': 1},
            '关闭': {'关闭': 1, '关': 1}
        }
    },
    '车门': {
        'operate': {
            '自动解锁': {'自动解锁': 1},
            '自动上锁': {'自动上锁': 1, '自动锁车': 1},
            '锁闭': {'锁闭': 1, '锁': 1, '上锁': 1, '锁上': 1},
            '解锁': {'解锁': 1, '开': 1, '开锁': 1, '打开': 1, '开开': 1},
            '更换': {'更换': 1, '替换': 1, '拆装': 1},
            '设置': {'设置': 1, '调出': 1, '用': 1, '使用': 1, '调': 1},
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1, '遥控器': 1, '智能遥控器': 1},
            '无钥匙系统': {'无钥匙系统': 1, '无钥匙': 1},
            '中控锁': {'中控锁': 1, '中央门锁按键': 1, },
            '机械钥匙': {'机械钥匙': 1, '钥匙': 1, '应急钥匙': 1, },
            '熄火': {'熄火': 1},
            '行驶': {'行驶': 1},
            '近车': {'近车': 1},
            '离车': {'离车': 1}
        }
    },
    '车门礼貌灯': {
        'operate': {
            '更换': {'更换': 1, '替换': 1, '换': 1, '拆装': 1}
        },
        'function': {
            '自动解锁': {'自动解锁': 1},
            '手动解锁': {'手动解锁': 1},
            '自动开锁': {'自动开锁': 1}
        }
    },
    '车身电子稳定系统': {
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '使用': 1, '启用': 1, '用': 1},
            '关闭': {'关闭': 1, '关停': 1, '停用': 1, '停止': 1, '关掉': 1}
        }
    },
    '倒车雷达系统': {
        'operate': {
            '开启': {'开启': 1, '设定': 1, '开': 1, '开开': 1, '用': 1, '使用': 1, '使': 1},
            '关闭': {'关闭': 1, '关上': 1}
        }
    },
    '电子手刹': {
        'operate': {
            '打开': {'打开': 1, '用': 1, '使用': 1},
            '关闭': {'关闭': 1, '松开': 1, '释放': 1, '松': 1, '关掉': 1}
        }
    },
    '儿童安全锁': {
        'operate': {
            '锁闭': {'锁闭': 1, '锁上': 1, '关': 1, '关闭': 1},
            '解锁': {'解锁': 1, '使': 1, '用': 1, '开': 1}
        }
    },
    '发动机舱盖': {
        'operate': {
            '打开': {'打开': 1, '开启': 1, '开': 1, '抠开': 1},
            '关闭': {'关闭': 1, '关上': 1, '关': 1, '扣上': 1, '盖上': 1}
        },
    },
    '防盗警报': {
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '使': 1, '用': 1, '使用': 1, '启用': 1},
            '关闭': {'关闭': 1, '停用': 1, '停止': 1, '停': 1}
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1}
        }
    },
    '服务中心': {
        'operate': {
            '联系': {'联系': 1, '呼叫': 1, '联络': 1, '呼救': 1}
        }
    },
    '后视镜': {
        'function': {
            '防眩目': {'防眩目': 1, '防炫目': 1},
            '下翻': {'下翻': 1},
        },
        'category': {
            '外': {'外': 1}
        },
        'property': {
            '角度': {'角度': 1},
        },
        'operate': {
            '储存': {'存储': 1, '记忆': 1, '保存': 1, '设定': 1},
            '打开': {'打开': 1, '使用': 1, '开启': 1, '开': 1, '开开': 1, '启用': 1, '用': 1, '使': 1},
            '关闭': {'关闭': 1, '关': 1, '关上': 1, '关掉': 1},
            '调节': {
                '调节': 1, '调整': 1, '调试': 1, '调': 1, '上调': 1, '下调': 1, '左调': 1, '右调': 1,
                '改变': 1, '设置': 1, '更改': 1, '更换': 1},
            '折叠': {'折叠': 1, '收起': 1, '收回': 1, '合上': 1, '和起': 1, '展开': 1, '外展': 1},

        },
        'condition': {
            '旋转按钮': {'旋转按钮': 1, },
            '触摸屏': {'触摸屏': 1, },
            '自动': {'自动': 1},
            '手动': {'手动': 1}
        }
    },
    '化妆镜照明灯': {
        'operate': {
            '更换': {'更换': 1, '替换': 1, '换': 1}
        },
    },
    '换档拨片': {
        'operate': {
            '使用': {'使用': 1, '升档': 1, '换档': 1, '降档': 1, '减档': 1, '加档': 1}
        }
    },
    '机油': {
        'operate': {
            '检查': {'检查': 1, '查看': 1, '查': 1, '检': 1, '检测': 1},
            '添加': {'添加': 1, '加注': 1, '补加': 1}
        }
    },
    '警告牌': {
        'operate': {
            '取出': {'取出': 1, '拿出': 1, '拿': 1, '用': 1, '使用': 1, '使': 1, '在哪': 1}
        }
    },
    '冷却液': {
        'operate': {
            '检查': {'检查': 1, '查看': 1, '查': 1, '检': 1},
            '添加': {'添加': 1, '加注': 1, '补加': 1}
        }
    },
    '轮胎': {
        'operate': {
            '拆卸': {'拆卸': 1, '拆下': 1, '取下': 1, '卸下': 1, '拆': 1, '卸': 1}
        }
    },
    '螺栓': {
        'operate': {
            '拧松': {'拧松': 1, '拆': 1, '卸': 1, '拧': 1}
        }
    },
    '牌照灯': {
        'operate': {
            '更换': {'更换': 1, '替换': 1, '换': 1, '拆装': 1}
        }
    },
    '千斤顶': {
        'operate': {
            '使用': {'使': 1, '用': 1}
        }
    },
    '牵引钩': {
        'operate': {
            '安装': {'安装': 1, '装上': 1, '装': 1}
        },
        'position': {
            '前': {'前': 1, '前部牵引钩': 1},
            '后': {'后': 1, '后部牵引钩': 1}
        }
    },
    '牵引力控制系统': {
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '用': 1},
            '关闭': {'关闭': 1, '关': 1, '关停': 1, '关掉': 1}
        }
    },
    '求救电话': {
        'operate': {
            '拨打': {'拨打': 1, '发起': 1, '使用': 1}
        }
    },
    '全地形反馈系统': {
        'operate': {
            '使用': {
                '使用': 1, '开启': 1, '调整': 1, '设置': 1, '打开': 1}
        }
    },
    '全景泊车系统': {
        'operate': {
            '开启': {
                '开启': 1, '打开': 1, '设定': 1, '使用': 1, '使': 1},
            '关闭': {'关闭': 1, '关上': 1, '关': 1}
        }
    },
    '手机互联': {
        'operate': {
            '使用': {'使用': 1, '开': 1, '使': 1, '启用': 1, '连接': 1, '开启': 1}
        }
    },
    '手机无线充电': {
        'operate': {
            '开启': {'开启': 1, '打开': 1, '使用': 1, '开开': 1},
            '关闭': {'关闭': 1, '关上': 1, '关掉': 1, '关': 1},
            '使用': {'使用': 1, '使': 1, '用': 1}
        }
    },
    '手套箱': {
        'position': {
            '主驾驶': {'主驾驶': 1},
            '副驾驶': {'副驾驶': 1, '乘客': 1}
        },
        'operate': {
            '打开': {'打开': 1, '开': 1, '开开': 1, '开启': 1, '使用': 1, '用': 1, '使': 1},
            '关闭': {
                '关闭': 1, '关': 1, '关上': 1, '关掉': 1}
        }
    },
    '随车工具': {
        'operate': {
            '取出': {'取出': 1, '取': 1, '拿': 1, '拿出': 1},
        }
    },
    '下坡辅助控制系统': {
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '用': 1, '使': 1, '使用': 1, '启用': 1, '打开': 1},
            '关闭': {'关闭': 1, '停': 1, '关停': 1, '停用': 1, '停止': 1, '关掉': 1, '关上': 1}
        }
    },
    '掀背门': {
        'property': {
            '高度': {'高度': 1},
            '电动功能': {'电动功能': 1}
        },
        'category': {
            '手动': {'手动': 1},
            '自动': {'自动': 1}
        },
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '打开': 1,},
            '关闭': {'关闭': 1, '关': 1, '关上': 1, '合上': 1},
            '设置': {'设置': 1, '设定': 1, '调整': 1, '调': 1, '调节': 1, '使用': 1}
        },
        'condition': {
            '遥控钥匙': {'遥控钥匙': 1, '遥控': 1},
            '仪表台按键': {'仪表台按键': 1},
            '无钥匙系统': {'无钥匙系统': 1},
            '自动感应': {'自动感应': 1, '感应': 1},
            '手动关闭': {'手动关闭': 1, '手动': 1},
            '后备箱按键': {'后备箱按键': 1, '后背门按键': 1}
        }
    },
    '蓄电池': {
        'operate': {
            '检查': {'检查': 1, '检测': 1},
            '搭电': {'搭电': 1, '接电': 1},
        }
    },
    '眼镜盒': {
        'operate': {
            '打开': {'打开': 1, '用': 1}
        }
    },
    '仪表': {
        'function': {
            '背光': {'背光': 1, '背景亮度': 1, '背景灯': 1, '背景光': 1},
            '信息': {'信息': 1, '显示信息': 1, '仪表信息': 1, '行车电脑信息': 1, '行车电脑显示': 1, '行车信息说明': 1},
            '设置': {'设置': 1, '默认设置': 1, '原厂设置': 1},
            '里程': {'里程': 1}
        },
        'operate': {
            '调节': {'调节': 1, '调整': 1, '调亮': 1, '调暗': 1, '变亮': 1, '变暗': 1, '调': 1},
            '切换': {'切换': 1, '换': 1, '转换': 1, '更改': 1, '调换': 1},
            '恢复': {'恢复': 1, '初始化': 1},
            '清零': {'清零': 1, '归零': 1}
        },
        'condition': {
            '方向盘按键': {'方向盘按键': 1, '多功能按键': 1, '多功能方向盘': 1}
        }
    },
    '音响': {
        'function': {
            '音量': {'音量': 1}
        },
        'operate': {
            '开启': {'开启': 1, '使': 1, '使用': 1, '启用': 1, '进入': 1, '开': 1, '打开': 1},
            '调节': {'调节': 1, '调': 1, '调整': 1, '增减': 1, '加减': 1, '增大': 1, '减少': 1, '方法': 1},
            '静音': {'静音': 1},
            '关闭': {'关闭': 1, '关': 1},
            '进入': {'进入': 1, '进': 1},
        },
        'condition': {
            '音响面板': {'音响面板': 1, '面板': 1},
            '方向盘': {'方向盘': 1, '多功能方向盘': 1}
        }
    },
    '遮物帘': {
        'operate': {
            '取出': {'取出': 1, '拿': 1, '拿出': 1, '取': 1, '用': 1,'在哪':1,'哪里':1},
            '安装': {'安装': 1, '装': 1, '用': 1, '按': 1, '使用': 1, '安': 1, '使': 1}
        }
    },
    '制动液': {
        'operate': {
            '检查': {'检查': 1, '看': 1, '检测': 1, }
        }
    },
    '智能启停系统': {
        'operate': {
            '开启': {'开启': 1, '开': 1, '开开': 1, '用': 1, '使用': 1, '打开': 1},
            '关闭': {'关闭': 1, '关上': 1, '关了': 1}
        }
    },
    '主动制动辅助系统': {
        'operate': {
            '开启': {'开启': 1, '调整': 1, '设置': 1, '使用': 1},
            '关闭': {'关闭': 1, '关上': 1}
        }
    },
    '自动驻车': {
        'operate': {
            '开启': {'开启': 1, '开开': 1, '开': 1, '启用': 1, '打开': 1},
            '关闭': {'关': 1, '关闭': 1, '停掉': 1}
        }
    },
    '自适应巡航控制系统': {
        'property': {
            '车速': {'车速': 1},
            '车距': {'车距': 1}
        },
        'operate': {
            '开启': {'开启': 1, '开开': 1, '开': 1, '用': 1, '使': 1, '使用': 1, '启用': 1,},
            '关闭': {'关闭': 1, '关': 1, '关停': 1, '关掉': 1, '停止': 1, '停用': 1, '关上': 1},
            '恢复': {'恢复': 1},
            '提高': {'提高': 1, '增加': 1, '加快': 1, '增高': 1, '调高': 1},
            '降低': {'降低': 1, '下调': 1, '减慢': 1, '减小': 1},
            '调整': {'调整': 1, '调节': 1, '设置': 1, '调': 1, '增加': 1, '减少': 1, '增大': 1, '减小': 1, '改变': 1},
            '重启': {'重启': 1}
        }
    },
    '点烟器': {
        'operate': {
            '使用': {'使用': 1, '用': 1, }
        }
    },
    '电源': {
        'category': {
            '点烟器': {'点烟器': 1},
            '中央扶手': {'中央扶手': 1},
            '行李箱': {'行李箱': 1},
            '扶手箱后电源': {'扶手箱后电源': 1},
            '扶手箱后USB': {'扶手箱后USB': 1}
        },
        'operate': {
            '使用': {'使用': 1, '用': 1, '使': 1}
        }
    },
    '音响系统': {
        'operate': {
            '进入': {'进入': 1},
            '打开': {'打开': 1, '开启': 1, '开开': 1, },
            '关闭': {'关闭': 1, '关': 1, '退出': 1, '关掉': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        }
    },
    '屏幕': {
        'operate': {
            '打开': {'打开': 1, '开开': 1, '开启': 1, '使用': 1}
        },
        'condition': {'音响面板': {'音响面板': 1}}
    },
    '导航系统': {
        'operate': {
            '进入': {'进入': 1, '进': 1, '转换': 1, '切换': 1, '调出': 1, '打开': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        }
    },
    '音源': {
        'operate': {
            '切换': {'切换': 1, '转换': 1, '换': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        }
    },
    '语音交互': {
        'category': {
            '本地': {'本地': 1,}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        },
        'operate': {
            '启动': {'启动': 1, '开启': 1, '开开': 1, '打开': 1},
            '关闭': {'关闭': 1, '关上': 1, '关掉': 1, '关': 1}
        }
    },
    '系统设置': {
        'operate': {
            '进入': {'进入': 1, '切换': 1, '转换': 1, '进': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        }
    },
    '系统功能': {
        'operate': {
            '选择': {'选择': 1, '使用': 1, '用': 1, '使': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1}
        }
    },
    '收音机': {
        'function': {
            '频道': {'频道': 1}
        },
        'operate': {
            '收藏': {'收藏': 1, '存': 1},
            '搜索': {'搜索': 1, '搜': 1},
            '输入': {'输入': 1},
            '调整': {'调整': 1, '调节': 1, '控制': 1, '调高': 1, '搜索': 1, '调': 1},
            '打开': {'打开': 1, '开': 1},
            '调节': {'调节': 1, '换': 1, '调': 1, '切换': 1, '选': 1, '改': 1, '更改': 1}
        },
        'condition': {
            '触摸屏': {'触摸屏': 1, '卡片模式界面': 1},
            '音响面板': {'音响面板': 1, '仪表台按键': 1},
            '方向盘': {'方向盘': 1, '多功能方向盘': 1}
        },
        'property': {
            '波段': {'波段': 1}
        },
    },
    '导航地图': {
        'operate': {
            '缩放': {'缩放': 1, '调整': 1, '调节': 1, '调大': 1, '缩小': 1, '调小': 1}
        },
        'condition': {
            '音响面板': {'音响面板': 1, '面板': 1}
        },
    },
    '曲目': {
        'operate': {
            '切换': {'选择': 1, '切换': 1, '更换': 1, '更改': 1, '换': 1},
            '搜索': {'搜索': 1}
        },
        'condition': {
            '方向盘': {'方向盘': 1},
            '触摸屏': {'触摸屏': 1}
        }
    },
    '电话': {
        'operate': {
            '接听': {'接听': 1, '接': 1, },
            '拒接': {'拒接': 1, '拒绝': 1, '拒': 1},
            '挂断': {'挂断': 1, '挂': 1, '结束': 1, '撂': 1, '挂掉': 1}

        },
        'condition': {
            '方向盘': {'方向盘': 1},
        }
    },
    '屏幕保护': {
        'operate': {
            '使用': {'使用': 1, '打开': 1, '用': 1, '启用': 1, '开启': 1}
        }
    },
    'USB音源': {
        'operate': {
            '启用': {'启用': 1, '切换': 1}
        },
        'condition': {
            '触摸屏': {'触摸屏': 1},
            '音响面板': {'音响面板': 1},
            '方向盘': {'方向盘': 1},
        },
    },
    'USB电源': {
        'operate': {
            '启用': {'启用': 1, '使用': 1, '用': 1, '切换': 1, '换': 1, '转换': 1}
        },
        'condition': {
            '触摸屏': {'触摸屏': 1},
            '音响面板': {'音响面板': 1},
            '方向盘': {'方向盘': 1}
        }
    },
    '音效': {
        'operate': {
            '切换': {'切换': 1, '转换': 1, '选取': 1, '选择': 1, '选': 1, '调整': 1, '调节': 1, '改变': 1}
        }
    },
    'USB视频': {
        'operate': {
            '播放': {'播放': 1, '开启': 1, '打开': 1, '使用': 1, '开': 1}
        }
    },
    'USB图片': {
        'operate': {
            '播放': {'播放': 1, '开启': 1, '打开': 1, '使用': 1, '开': 1}
        }
    },
    '蓝牙': {
        'function': {
            '电话': {'电话': 1},
            '通话记录': {'通话记录': 1, '通话': 1, '记录': 1},
            '电话号码': {'电话号码': 1, '号码': 1},
            '联系人': {'联系人': 1}
        },
        'operate': {
            '进入': {'进入': 1, '转换': 1, '切换': 1, '调出': 1},
            '连接': {'连接': 1, '使用': 1, '开启': 1},
            '拨打': {'拨打': 1, '拨': 1, '打': 1, '拨出': 1, '去': 1},
            '接听': {'接听': 1, '接': 1, '听': 1, '接通': 1},
            '同步': {'同步': 1, '共享': 1, },
            '查找': {'查找': 1, '查看': 1, '查询': 1, '找': 1, '查': 1},
            '呼叫等待': {'呼叫等待': 1, '呼叫': 1, }
        },
        'condition': {
            '进入界面': {'进入界面': 1, },
            '连接': {'连接': 1},
            '拨打电话': {'拨打电话': 1},
            '接听电话': {'接听电话': 1},
            '同步电话号码': {'同步电话号码': 1},
            '同步通话记录': {'同步通话记录': 1},
            '呼叫等待': {'呼叫等待': 1}
        }
    },
    'IPOD': {
        'operate': {
            '播放': {'播放': 1, '播': 1, '放': 1, '操作': 1, '打开': 1, '开': 1}
        }
    },
    '车辆信息': {
        'operate': {
            '设置': {'设置': 1}
        }
    },
    '车生活': {
        'operate': {
            '使用': {'使用': 1, '打开': 1, '开启': 1, '开': 1, '用': 1, '开开': 1}
        }
    },
    '起动开关': {
        'operate': {
            '使用': {'使用': 1, '用': 1, '使': 1, '切换': 1, '变换': 1, '转换': 1}
        }
    },
    '变速箱': {
        'function': {
            '档位': {'档位': 1}
        }
    },
    'P档': {
        'operate': {
            '使用': {'使用': 1, '变换': 1, '用': 1, '换': 1}
        }
    },
    'R档': {
        'operate': {
            '使用': {'使用': 1, '变换': 1, '用': 1, '换': 1}
        }
    },
    'N档': {
        'operate': {
            '使用': {'使用': 1, '变换': 1, '用': 1, '换': 1}
        }
    },
    'D档': {
        'operate': {
            '使用': {'使用': 1, '变换': 1, '用': 1, '换': 1}
        }
    },
    'S档': {
        'operate': {
            '使用': {'使用': 1, '变换': 1, '用': 1, '换': 1}
        }
    },
    '驾驶模式': {
        'operate': {
            '切换': {'切换': 1, '变换': 1, '换': 1, '使用': 1, '用': 1, '选择': 1, '选': 1}
        },
        'category': {
            '普通模式': {'普通模式': 1, '普通': 1},
            '雪地模式': {'雪地模式': 1, '雪地': 1},
            '经济模式': {'经济模式': 1, '经济': 1},
            '手动模式': {'手动模式': 1, '手动': 1}
        }
    },
    '车辆': {
        'operate': {
            '起步': {'起步': 1},
            '制动': {'制动': 1},
            '停车': {'停车': 1}
        }
    },
    '电子驻车制动系统': {
        'operate': {
            '学习': {'学习': 1, '初始化': 1, '自学习': 1, '匹配': 1, '设置': 1, '设定': 1}
        },
    },
    '启停系统': {
        'operate': {
            '学习': {'学习': 1, '初始化': 1, '自学习': 1, '匹配': 1, '设置': 1, '设定': 1}
        }
    },
    '自适应巡航': {
        'operate': {
            '启动': {'启动': 1, '开开': 1, '开': 1, '用': 1, '使': 1, '使用': 1, '启用': 1, },
            '关闭': {'关闭': 1, '关': 1, '关停': 1, '关掉': 1, '停止': 1, '停用': 1, '关上': 1},
            '恢复': {'恢复': 1},
            '提高': {'提高': 1, '增加': 1, '加快': 1, '增高': 1, '调高': 1},
            '降低': {'降低': 1, '下调': 1, '减慢': 1, '减小': 1},
            '调整': {'调整': 1, '调节': 1, '设置': 1, '调': 1, '增加': 1, '减少': 1, '增大': 1, '减小': 1, '改变': 1},
            '重启': {'重启': 1}
        }
    },
    '油箱盖': {
        'operate': {
            '打开': {'打开': 1, '开启': 1, '开开': 1, '开': 1}
        }
    },
    '保险盒': {
        'operate': {
            '打开': {'打开': 1, '开开': 1, '开': 1, '开启': 1, }
        },
        'category': {
            '仪表板': {'仪表板': 1, '仪表盘': 1},
            '发动机舱': {'发动机舱': 1}
        }
    },
    '电瓶': {
        'operate': {
            '搭电': {'搭电': 1}
        }
    },
    '四轮驱动锁止模式指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '充电系统报警灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '发动机故障指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '机油压力低报警灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '排放故障指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '左转向信号与危险警告指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '车道偏移状态指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '前碰预警状态指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '发动机冷却液温度高指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '辅助保护系统指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '燃油低指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '自适应巡航指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '右转向信号与危险警告指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '防盗启动锁止系统指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '电子刹车状态指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '电子刹车故障指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '手刹车与制动系统指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '车辆稳定性辅助指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '车辆稳定性辅助关闭': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '防抱死制动系统指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '变速箱故障指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '胎压检测系统指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '电动助力转向指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '定速巡航指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '前排乘员座椅安全带提示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    'ECO经济模式指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '驾驶员座椅安全带提示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '启停系统故障指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '启停系统工作指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '远光指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '点灯指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '前雾灯指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '后雾灯指示灯': {
        'operate': {
            '亮起': {'亮起': 1, '亮': 1}
        }
    },
    '前碰撞预警系统': {
        'operate': {
            '关闭': {'关闭': 1},
            '开启': {'开启': 1, '使': 1}
        }
    },

}
