# _*_ coding: utf-8 _*_


# 相似问题
syno_query = {
    1: ["帮我打着汽车","拧钥匙着车", "启动引擎", "启动发动机", "我想打着火", "着车", "打着火", "发动机点火", "打开引擎", "启动车辆", "打开发动机", "我要发动汽车", "一键启动", "汽车启动",
        "咱们出发吧，着车啦","帮我打着汽车，设定导航吧。",
        "来帮我启动引擎，出发啦", "我要一键启动，准备走了", "启动我的汽车，lets go", "让我们启动汽车，马上出发吧", "让我听到发动机的轰鸣，跑起来吧", "让我一起开动起来吧", "着车走人啦，启动吧",
        "让我们启动汽车，马上出发吧"],
    2: ["关闭发动机", "关闭引擎", "车熄火", "熄灭发动机", "灭车", "灭火", "怎么灭车呢", "拧钥匙灭车", "一键熄火", "到地方了，熄火吧", "我要停车", "把车火熄了", "给我把车熄灭吧",
        "给车把火熄了", "紧急情况，我要刹车熄火", "到达目的地了，关引擎熄火", "我想是到地方了，停车熄火吧"],
    3: ["打开空调", "打开汽车空调", "空调怎么打开", "我想打开空调", "我要打开空调", "有点热了，帮我开冷气", "暖风帮我开一下，车里有点冷", "天寒地冻的，吹点暖风吧",
        "玻璃有雾，帮我打开吹暖风吹玻璃"],
    4: ["关闭空调", "怎么关闭空调", "给我把空调关上", "赶紧给我把空调都关了","车里有点冷，把空调关了吧"],
    5: ["调节到22度","调节空调温度", "怎么用空调调节温度", "怎么调节温度", "怎么降低温度", "怎么设置空调温度",
        "今天热", "今天闷热", "今天很冷", "天气真热", "温度调低一点", "温度调到23度", "温度再高一点", "温度调高一些", "越来越冷了，空调调高点温度", "越来越热了，空调调低点","温度有点不舒服，空调调到25度","再调高点"],
    6: ["油表查看油量", "查看车还剩多少油", "怎么查看还有多少油", "邮箱还有多少油", "还有几个油", "怎么看车还剩多少油",
        "车剩多少油怎么看", "我车还剩多少油", "我车还有多少油", "我车能装多少油", "还有多少油",
        "怎么看车还剩多少油", "怎么才知道我车还有多少油", "车剩多少油怎么看", "看哪里知道我车有多少油",
        "油箱还有多少油怎么看", "如何看我车还有多少油", "如何知道我车还有多少油", "怎么看车耗了多少油",
        "车还有几个油 ", "燃油亏到什么程度可以加油"],
    7: ["行车电脑显示公里", "不加油还能行驶多少公里", "我车还能开多久", "车还剩几个油能跑多少公里", "我车一箱油能跑多远",
        "我车能跑多远", "怎么知道我车还能跑多远", "看那里知道我车还能开多远", "我想知道车还能跑多远",
        "我的车还有多少燃油还能行驶多少公里", "我的车还有多少燃油还能跑多少公里", "我不加油还能跑多少公里",
        "我不加油还能行驶多少公里"],
    8: ["油箱装油", "车能装多少油", "我车的油箱多大容积", "油箱多大的", "邮箱能装多少油"],
    9: ["空调打不开", "空调启动不了", "打不开了空调", "无法启动空调", "无法打开空调", "空调不易启动", "空调不易打开",
        "空调无法运行", "空调不转", "空调没法用"],
    10: ["发动机异响", "发动机有响声", "发动机响", "发动机有响声", "发动机有杂音"],
    11: ["发动机不易启动", "发动机不易开启", "发动机不容易打开", "发动机启动困难", "没法启动发动机",
         "无法启动发动机", "发动机启动困难", "发动机不容易发动"],
    12: ["发动机抖动", "发动机突突", "发动机晃悠", "发动机不稳定", "发动机震动", "发动机颤抖",
         "发动机一抖一抖的", "发动机颤动"],
    13: ["发动机噪音大", "发动机声音大", "发动机杂音大", "发动机噪声很大", "发动机发出很大的声音"]
}

# 相似问题对应的标准问题
std_query = {
    1: "启动发动机",
    2: "关闭发动机",
    3: "打开空调",
    4: "关闭空调",
    5: "调节空调温度",
    6: "油表查看油量",
    7: "行车电脑显示公里",
    8: "油箱装油",
    9: "空调打不开",
    10: "发动机异响",
    11: "发动机不易启动",
    12: "发动机抖动",
    13: "发动机噪音大"
}
